Core/src/src/AccumulationRegisters/РезервированиеЗапасов/РезервированиеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеЗапасов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <comment>ONESOFT-3602</comment>
    <type>
      <types>DefinedType.ДокументПоступленияДляFIFO</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/CommonModules/РезервированиеЗапасов_new/Module.bsl
Процедура ОтразитьРезервированиеЗапасов(ДополнительныеСвойства, Движения, Отказ) ЭКСПОРТ
	
	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаРезервированиеЗапасов") Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезервированиеЗапасов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРезервированиеЗапасов;
	
	Если Отказ
	 ИЛИ ТаблицаРезервированиеЗапасов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРезервированиеЗапасов = Движения.РезервированиеЗапасов;
	ДвиженияРезервированиеЗапасов.Записывать = Истина;
	ДвиженияРезервированиеЗапасов.Загрузить(ТаблицаРезервированиеЗапасов);
	
КонецПроцедуры

Процедура ОбработатьВременнуюТаблицуДвиженияРезервированиеЗапасовИзменение(ДополнительныеСвойства) ЭКСПОРТ
	ПЕРЕМ ПересоздатьДвиженияРезервированиеЗапасовИзменение;
	
	ПересоздатьДвиженияРезервированиеЗапасовИзменение = ЛОЖЬ;

	МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	ВременныеТаблицыЗапроса = МенеджерВременныхТаблиц.Таблицы;
	
	ДвиженияРезервированиеЗапасовИзменение = ВременныеТаблицыЗапроса.Получить("ДвиженияРезервированиеЗапасовИзменение");
	
	Если ДвиженияРезервированиеЗапасовИзменение = НЕОПРЕДЕЛЕНО Тогда
	
		Если ВременныеТаблицыЗапроса.Найти("ДвиженияЗапасыИзменение") = НЕОПРЕДЕЛЕНО Тогда
			
			РегистрыНакопления.РезервированиеЗапасов.ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства);
			
		Иначе
			
			ПересоздатьДвиженияРезервированиеЗапасовИзменение = ИСТИНА;
			
		КонецЕсли;
		
	Иначе
		
		РезультатЗапроса = ДвиженияРезервированиеЗапасовИзменение.ПолучитьДанные();
		Если РезультатЗапроса.Пустой() Тогда
			
			Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРезервированиеЗапасовИзменение");
			
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			РезультатЗапроса = Запрос.Выполнить();
			
			Если ВременныеТаблицыЗапроса.Найти("ДвиженияЗапасыИзменение") = НЕОПРЕДЕЛЕНО Тогда
				
				РегистрыНакопления.РезервированиеЗапасов.ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства);
				
			Иначе
				
				ПересоздатьДвиженияРезервированиеЗапасовИзменение = ИСТИНА;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли; 
	
	Если ПересоздатьДвиженияРезервированиеЗапасовИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК Организация,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК Документ,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|	ДвиженияЗапасыИзменение.Партия КАК Партия,
		|	ДвиженияЗапасыИзменение.Проект КАК Проект,
		|	0 КАК КоличествоПередЗаписью,
		|	0 КАК КоличествоИзменение,
		|	0 КАК КоличествоПриЗаписи
		|ПОМЕСТИТЬ ДвиженияРезервированиеЗапасовИзменение
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение");
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		РезультатЗапроса = Запрос.Выполнить();		
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТекстЗапросаКонтроля_РезервированиеЗапасов(ДополнительныеСвойства, ДобавитьРзделитель = ЛОЖЬ) ЭКСПОРТ
	
	//КонтролироватьОстаткиПоПроектам = Константы.ФункциональнаяОпцияУчетПоПроектам.Получить() И Константы.КонтролироватьОстаткиПриПроведенииПоПроектам.Получить();
	
	ОбработатьВременнуюТаблицуДвиженияРезервированиеЗапасовИзменение(ДополнительныеСвойства);
	
	ТекстЗапроса = "ВЫБРАТЬ
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |	ЗапасыОстатки.Организация КАК Организация,
				   |	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |	ЗапасыОстатки.Номенклатура КАК Номенклатура,
				   |	ЗапасыОстатки.Характеристика КАК Характеристика,
				   |	ЗапасыОстатки.Партия КАК Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА ЗапасыОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ КАК Проект,
				   |	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
				   |ПОМЕСТИТЬ ЗапасыОстаткиДляРезервирования
				   |ИЗ
				   |	РегистрНакопления.Запасы.Остатки(
				   |			&МоментКонтроля,
				   |			(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
				   |				(ВЫБРАТЬ
				   |					ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   |					ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |					ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   |					ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   |					ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
				   |				ИЗ
				   |					ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК ЗапасыОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
				   |		ПО ЗапасыОстатки.Организация = ДвиженияРезервированиеЗапасовИзменение.Организация
				   |			И ЗапасыОстатки.СтруктурнаяЕдиница = ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница
				   |			И ЗапасыОстатки.Номенклатура = ДвиженияРезервированиеЗапасовИзменение.Номенклатура
				   |			И ЗапасыОстатки.Характеристика = ДвиженияРезервированиеЗапасовИзменение.Характеристика
				   |			И ЗапасыОстатки.Партия = ДвиженияРезервированиеЗапасовИзменение.Партия
				   |			И (ВЫБОР
				   |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |					ТОГДА ЗапасыОстатки.Проект = ДвиженияРезервированиеЗапасовИзменение.Проект
				   |				ИНАЧЕ ИСТИНА
				   |			КОНЕЦ)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ЗапасыОстатки.Организация,
				   |	ЗапасыОстатки.СтруктурнаяЕдиница,
				   |	ЗапасыОстатки.Номенклатура,
				   |	ЗапасыОстатки.Характеристика,
				   |	ЗапасыОстатки.Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА ЗапасыОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Организация,
				   |	СтруктурнаяЕдиница,
				   |	Номенклатура,
				   |	Характеристика,
				   |	Партия,
				   |	Проект
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РезервированиеЗапасовОстатки.Организация КАК Организация,
				   |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |	РезервированиеЗапасовОстатки.Номенклатура КАК Номенклатура,
				   |	РезервированиеЗапасовОстатки.Характеристика КАК Характеристика,
				   |	РезервированиеЗапасовОстатки.Партия КАК Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА РезервированиеЗапасовОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ КАК Проект,
				   |	СУММА(РезервированиеЗапасовОстатки.КоличествоОстаток) КАК КоличествоОстаток
				   |ПОМЕСТИТЬ РезервированиеЗапасовОстаткиДляРезервирования
				   |ИЗ
				   |	РегистрНакопления.РезервированиеЗапасов.Остатки(
				   |			&МоментКонтроля,
				   |			(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
				   |				(ВЫБРАТЬ
				   |					ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   |					ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |					ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   |					ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   |					ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
				   |				ИЗ
				   |					ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК РезервированиеЗапасовОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
				   |		ПО (ДвиженияРезервированиеЗапасовИзменение.Организация = РезервированиеЗапасовОстатки.Организация)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Характеристика = РезервированиеЗапасовОстатки.Характеристика)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Партия = РезервированиеЗапасовОстатки.Партия)
				   |			И (ВЫБОР
				   |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |					ТОГДА ДвиженияРезервированиеЗапасовИзменение.Проект = РезервированиеЗапасовОстатки.Проект
				   |				ИНАЧЕ ИСТИНА
				   |			КОНЕЦ)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	РезервированиеЗапасовОстатки.Организация,
				   |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница,
				   |	РезервированиеЗапасовОстатки.Номенклатура,
				   |	РезервированиеЗапасовОстатки.Характеристика,
				   |	РезервированиеЗапасовОстатки.Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА РезервированиеЗапасовОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Организация,
				   |	СтруктурнаяЕдиница,
				   |	Номенклатура,
				   |	Характеристика,
				   |	Партия,
				   |	Проект
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РезервированиеЗапасовОстатки.Организация КАК Организация,
				   |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |	РезервированиеЗапасовОстатки.Документ КАК Документ,
				   |	РезервированиеЗапасовОстатки.Номенклатура КАК Номенклатура,
				   |	РезервированиеЗапасовОстатки.Характеристика КАК Характеристика,
				   |	РезервированиеЗапасовОстатки.Партия КАК Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА РезервированиеЗапасовОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ КАК Проект,
				   |	СУММА(РезервированиеЗапасовОстатки.КоличествоОстаток) КАК КоличествоОстаток
				   |ПОМЕСТИТЬ РезервированиеЗапасовОстаткиСДокументомДляРезервирования
				   |ИЗ
				   |	РегистрНакопления.РезервированиеЗапасов.Остатки(
				   |			&МоментКонтроля,
				   |			(Организация, СтруктурнаяЕдиница, Документ, Номенклатура, Характеристика, Партия) В
				   |				(ВЫБРАТЬ
				   |					ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   |					ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   |					ДвиженияРезервированиеЗапасовИзменение.Документ КАК Документ,
				   |					ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   |					ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   |					ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
				   |				ИЗ
				   |					ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК РезервированиеЗапасовОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
				   |		ПО (ДвиженияРезервированиеЗапасовИзменение.Организация = РезервированиеЗапасовОстатки.Организация)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Документ = РезервированиеЗапасовОстатки.Документ)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Характеристика = РезервированиеЗапасовОстатки.Характеристика)
				   |			И (ДвиженияРезервированиеЗапасовИзменение.Партия = РезервированиеЗапасовОстатки.Партия)
				   |			И (ВЫБОР
				   |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |					ТОГДА ДвиженияРезервированиеЗапасовИзменение.Проект = РезервированиеЗапасовОстатки.Проект
				   |				ИНАЧЕ ИСТИНА
				   |			КОНЕЦ)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	РезервированиеЗапасовОстатки.Организация,
				   |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница,
				   |	РезервированиеЗапасовОстатки.Документ,
				   |	РезервированиеЗапасовОстатки.Номенклатура,
				   |	РезервированиеЗапасовОстатки.Характеристика,
				   |	РезервированиеЗапасовОстатки.Партия,
				   |	ВЫБОР
				   |		КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |			ТОГДА РезервированиеЗапасовОстатки.Проект
				   |		ИНАЧЕ ДвиженияРезервированиеЗапасовИзменение.Проект
				   |	КОНЕЦ
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Организация,
				   |	СтруктурнаяЕдиница,
				   |	Документ,
				   |	Номенклатура,
				   |	Характеристика,
				   |	Партия,
				   |	Проект
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |	ДвиженияРезервированиеЗапасовИзменение.НомерСтроки КАК НомерСтроки,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Организация) КАК ОрганизацияПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Номенклатура) КАК НоменклатураПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Документ) КАК ЗаказПокупателяПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Характеристика) КАК ХарактеристикаПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Партия) КАК ПартияПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Проект) КАК ПроектПредставление,
				   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
				   |	ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи, 0) КАК ОстатокЗапасы,
				   |	ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы
				   |ИЗ
				   |	ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервированиеЗапасов.Остатки(
				   //|				&МоментКонтроля,
				   //|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Документ) В
				   //|					(ВЫБРАТЬ
				   //|						ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   //|						ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Документ КАК Документ
				   //|					ИЗ
				   //|						ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК РезервированиеЗапасовОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РезервированиеЗапасовОстаткиСДокументомДляРезервирования КАК РезервированиеЗапасовОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |		ПО ДвиженияРезервированиеЗапасовИзменение.Организация = РезервированиеЗапасовОстатки.Организация
				   |			И ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница
				   |			И ДвиженияРезервированиеЗапасовИзменение.Документ = РезервированиеЗапасовОстатки.Документ
				   |			И ДвиженияРезервированиеЗапасовИзменение.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура
				   |			И ДвиженияРезервированиеЗапасовИзменение.Характеристика = РезервированиеЗапасовОстатки.Характеристика
				   |			И ДвиженияРезервированиеЗапасовИзменение.Партия = РезервированиеЗапасовОстатки.Партия
				   |			И (ВЫБОР
				   |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
				   |					ТОГДА ДвиженияРезервированиеЗапасовИзменение.Проект = РезервированиеЗапасовОстатки.Проект
				   |				ИНАЧЕ ИСТИНА
				   |			КОНЕЦ),
				   |	Константы КАК Константы
				   |ГДЕ
				   |	ДвиженияРезервированиеЗапасовИзменение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				   |	И ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) < 0
				   |	И Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
				   //+++ Дмгг, Исключение по реквизиту справочника
				   |	И НЕ ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница.КонтролироватьОстатки
				   //--- Дмгг
				   |
				   |ОБЪЕДИНИТЬ
				   |
				   |ВЫБРАТЬ
	               |	ДвиженияРезервированиеЗапасовИзменение.НомерСтроки,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Организация),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Номенклатура),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Документ),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Характеристика),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Партия),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Проект),
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРезервированиеЗапасовИзменение.Номенклатура.ЕдиницаИзмерения),
	               |	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - (ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ДвиженияРезервированиеЗапасовИзменениеСвернутое.КоличествоПриЗаписи, 0)),
	               |	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0)				   
	               |ИЗ
	               |	ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
	               |			ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |			ДвиженияРезервированиеЗапасовИзменение.Документ КАК Документ,
	               |			ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
	               |			ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
	               |			ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия,
	               |			ДвиженияРезервированиеЗапасовИзменение.Проект КАК Проект,
	               |			СУММА(ВЫБОР
	               |					КОГДА ДвиженияРезервированиеЗапасовИзменение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |						ТОГДА ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи
	               |					ИНАЧЕ -ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи
	               |				КОНЕЦ) КАК КоличествоПриЗаписи
	               |		ИЗ
	               |			ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ДвиженияРезервированиеЗапасовИзменение.Организация,
	               |			ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница,
	               |			ДвиженияРезервированиеЗапасовИзменение.Документ,
	               |			ДвиженияРезервированиеЗапасовИзменение.Номенклатура,
	               |			ДвиженияРезервированиеЗапасовИзменение.Характеристика,
	               |			ДвиженияРезервированиеЗапасовИзменение.Партия,
	               |			ДвиженияРезервированиеЗапасовИзменение.Проект) КАК ДвиженияРезервированиеЗапасовИзменениеСвернутое
	               |		ПО (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Организация = ДвиженияРезервированиеЗапасовИзменение.Организация)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.СтруктурнаяЕдиница = ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Номенклатура = ДвиженияРезервированиеЗапасовИзменение.Номенклатура)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Характеристика = ДвиженияРезервированиеЗапасовИзменение.Характеристика)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Партия = ДвиженияРезервированиеЗапасовИзменение.Партия)
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияРезервированиеЗапасовИзменениеСвернутое.Проект = ДвиженияРезервированиеЗапасовИзменение.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
				   //|				&МоментКонтроля,
				   //|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
				   //|					(ВЫБРАТЬ
				   //|						ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   //|						ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
				   //|					ИЗ
				   //|						ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК ЗапасыОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыОстаткиДляРезервирования КАК ЗапасыОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
	               |		ПО (ЗапасыОстатки.Организация = ДвиженияРезервированиеЗапасовИзменение.Организация)
	               |			И (ЗапасыОстатки.СтруктурнаяЕдиница = ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница)
	               |			И (ЗапасыОстатки.Номенклатура = ДвиженияРезервированиеЗапасовИзменение.Номенклатура)
	               |			И (ЗапасыОстатки.Характеристика = ДвиженияРезервированиеЗапасовИзменение.Характеристика)
	               |			И (ЗапасыОстатки.Партия = ДвиженияРезервированиеЗапасовИзменение.Партия)
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ЗапасыОстатки.Проект = ДвиженияРезервированиеЗапасовИзменение.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервированиеЗапасов.Остатки(
				   //|				&МоментКонтроля,
				   //|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
				   //|					(ВЫБРАТЬ
				   //|						ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
				   //|						ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
				   //|						ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
				   //|					ИЗ
				   //|						ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК РезервированиеЗапасовОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РезервированиеЗапасовОстаткиДляРезервирования КАК РезервированиеЗапасовОстатки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
	               |		ПО ДвиженияРезервированиеЗапасовИзменение.Организация = РезервированиеЗапасовОстатки.Организация
	               |			И ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница
	               |			И ДвиженияРезервированиеЗапасовИзменение.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура
	               |			И ДвиженияРезервированиеЗапасовИзменение.Характеристика = РезервированиеЗапасовОстатки.Характеристика
	               |			И ДвиженияРезервированиеЗапасовИзменение.Партия = РезервированиеЗапасовОстатки.Партия
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияРезервированиеЗапасовИзменение.Проект = РезервированиеЗапасовОстатки.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
	               |		ПО (ДвиженияЗапасыИзменение.Организация = ДвиженияРезервированиеЗапасовИзменение.Организация)
	               |			И (ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница)
	               |			И (ДвиженияЗапасыИзменение.Номенклатура = ДвиженияРезервированиеЗапасовИзменение.Номенклатура)
	               |			И (ДвиженияЗапасыИзменение.Характеристика = ДвиженияРезервированиеЗапасовИзменение.Характеристика)
	               |			И (ДвиженияЗапасыИзменение.Партия = ДвиженияРезервированиеЗапасовИзменение.Партия)
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияЗапасыИзменение.Проект = ДвиженияРезервированиеЗапасовИзменение.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ),
	               |	Константы КАК Константы
	               |ГДЕ
	               |	ДвиженияРезервированиеЗапасовИзменение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0)< 0
	               |	И Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
				   //+++ Дмгг, Исключение по реквизиту справочника
	               |	И НЕ ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница.КонтролироватьОстатки
				   //--- Дмгг
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |УНИЧТОЖИТЬ ЗапасыОстаткиДляРезервирования
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |УНИЧТОЖИТЬ РезервированиеЗапасовОстаткиДляРезервирования
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |УНИЧТОЖИТЬ РезервированиеЗапасовОстаткиСДокументомДляРезервирования
				   // Kuzmich, 08.12.2024, (ONESOFT-3540) Karcher - заполнить по партиям - добавить логику по новом финкционале резервирование, исправления и доделки
				   |";
	
	Если ДобавитьРзделитель Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
	КонецЕсли;
	
	Возврат ТекстЗапроса;
			
КонецФункции

Функция ПолучитьТекстЗапросаКонтроля_СвободныеОстатки(ДополнительныеСвойства, ДобавитьРзделитель = ЛОЖЬ) ЭКСПОРТ
	
	ОбработатьВременнуюТаблицуДвиженияРезервированиеЗапасовИзменение(ДополнительныеСвойства);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	МИНИМУМ(ДвиженияЗапасыИзменение.НомерСтроки) КАК НомерСтроки,
	               |	ДвиженияЗапасыИзменение.Организация КАК Организация,
	               |	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл,
	               |	ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
	               |	ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
	               |	ДвиженияЗапасыИзменение.Партия КАК Партия,
	               |	ДвиженияЗапасыИзменение.Проект КАК Проект,
	               |	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ДвиженияЗапасыИзменение.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК ОстатокЗапасы,
	               |	СУММА(ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоПриЗаписи, 0)) КАК КоличествоДвижение
	               |ПОМЕСТИТЬ ТЗ_Запасы
	               |ИЗ
	               |	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	               |				&МоментКонтроляРезерва,
	               |				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
	               |					(ВЫБРАТЬ
	               |						ДвиженияЗапасыИзменение.Организация КАК Организация,
	               |						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
	               |						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
	               |						ДвиженияЗапасыИзменение.Партия КАК Партия
	               |					ИЗ
	               |						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
	               |		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
	               |			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	               |			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
	               |			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
	               |			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
	               |			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияЗапасыИзменение.Проект = ЗапасыОстатки.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ),
	               |	Константы КАК Константы
	               |ГДЕ
	               |	Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
	               |	И НЕ ДвиженияЗапасыИзменение.СтруктурнаяЕдиница.КонтролироватьОстатки
				   |	И ДвиженияЗапасыИзменение.КоличествоИзменение > 0
	               |	И (ДвиженияЗапасыИзменение.ЗаказПокупателя ЕСТЬ NULL
	               |			ИЛИ ДвиженияЗапасыИзменение.ЗаказПокупателя = НЕОПРЕДЕЛЕНО
	               |			ИЛИ ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ДвиженияЗапасыИзменение.Организация,
				   |	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница,
				   |	ДвиженияЗапасыИзменение.СчетУчетаРегл,
				   |	ДвиженияЗапасыИзменение.Номенклатура,
				   |	ДвиженияЗапасыИзменение.Характеристика,
				   |	ДвиженияЗапасыИзменение.Партия,
				   |	ДвиженияЗапасыИзменение.Проект,
				   |	ДвиженияЗапасыИзменение.ЗаказПокупателя,
				   |	ДвиженияЗапасыИзменение.Номенклатура.ЕдиницаИзмерения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(ДвиженияРезервированиеЗапасовИзменение.НомерСтроки) КАК НомерСтроки,
	               |	ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
	               |	ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
	               |	ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
	               |	ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия,
	               |	ДвиженияРезервированиеЗапасовИзменение.Проект КАК Проект,
	               |	СУММА(ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0)) КАК ОстатокЗапасы,
	               |	СУММА(ЕСТЬNULL(ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи, 0)) КАК КоличествоДвижение
	               |ПОМЕСТИТЬ ТЗ_Резервы
	               |ИЗ
	               |	ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
	               |			ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |			ДвиженияРезервированиеЗапасовИзменение.Документ КАК Документ,
	               |			ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
	               |			ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
	               |			ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия,
	               |			ДвиженияРезервированиеЗапасовИзменение.Проект КАК Проект,
	               |			СУММА(ВЫБОР
	               |					КОГДА ДвиженияРезервированиеЗапасовИзменение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |						ТОГДА ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи
	               |					ИНАЧЕ -ДвиженияРезервированиеЗапасовИзменение.КоличествоПриЗаписи
	               |				КОНЕЦ) КАК КоличествоПриЗаписи
	               |		ИЗ
	               |			ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ДвиженияРезервированиеЗапасовИзменение.Организация,
	               |			ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница,
	               |			ДвиженияРезервированиеЗапасовИзменение.Документ,
	               |			ДвиженияРезервированиеЗапасовИзменение.Номенклатура,
	               |			ДвиженияРезервированиеЗапасовИзменение.Характеристика,
	               |			ДвиженияРезервированиеЗапасовИзменение.Партия,
	               |			ДвиженияРезервированиеЗапасовИзменение.Проект) КАК ДвиженияРезервированиеЗапасовИзменениеСвернутое
	               |		ПО (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Организация = ДвиженияРезервированиеЗапасовИзменение.Организация)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.СтруктурнаяЕдиница = ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Номенклатура = ДвиженияРезервированиеЗапасовИзменение.Номенклатура)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Характеристика = ДвиженияРезервированиеЗапасовИзменение.Характеристика)
	               |			И (ДвиженияРезервированиеЗапасовИзменениеСвернутое.Партия = ДвиженияРезервированиеЗапасовИзменение.Партия)
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияРезервированиеЗапасовИзменениеСвернутое.Проект = ДвиженияРезервированиеЗапасовИзменение.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервированиеЗапасов.Остатки(
	               |				&МоментКонтроляРезерва,
	               |				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
	               |					(ВЫБРАТЬ
	               |						ДвиженияРезервированиеЗапасовИзменение.Организация КАК Организация,
	               |						ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |						ДвиженияРезервированиеЗапасовИзменение.Номенклатура КАК Номенклатура,
	               |						ДвиженияРезервированиеЗапасовИзменение.Характеристика КАК Характеристика,
	               |						ДвиженияРезервированиеЗапасовИзменение.Партия КАК Партия
	               |					ИЗ
	               |						ДвиженияРезервированиеЗапасовИзменение КАК ДвиженияРезервированиеЗапасовИзменение)) КАК РезервированиеЗапасовОстатки
	               |		ПО ДвиженияРезервированиеЗапасовИзменение.Организация = РезервированиеЗапасовОстатки.Организация
	               |			И ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница
	               |			И ДвиженияРезервированиеЗапасовИзменение.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура
	               |			И ДвиженияРезервированиеЗапасовИзменение.Характеристика = РезервированиеЗапасовОстатки.Характеристика
	               |			И ДвиженияРезервированиеЗапасовИзменение.Партия = РезервированиеЗапасовОстатки.Партия
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ДвиженияРезервированиеЗапасовИзменение.Проект = РезервированиеЗапасовОстатки.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ),
	               |	Константы КАК Константы
	               |ГДЕ
	               |	ДвиженияРезервированиеЗапасовИзменение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
	               |	И НЕ ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница.КонтролироватьОстатки
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ДвиженияРезервированиеЗапасовИзменение.Организация,
				   |	ДвиженияРезервированиеЗапасовИзменение.СтруктурнаяЕдиница,
				   |	ДвиженияРезервированиеЗапасовИзменение.Номенклатура,
				   |	ДвиженияРезервированиеЗапасовИзменение.Характеристика,
				   |	ДвиженияРезервированиеЗапасовИзменение.Партия,
				   |	ДвиженияРезервированиеЗапасовИзменение.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ_Запасы.НомерСтроки КАК НомерСтроки,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.Организация) КАК ОрганизацияПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.СчетУчетаРегл) КАК СчетУчетаРеглПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.Номенклатура) КАК НоменклатураПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.Характеристика) КАК ХарактеристикаПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.Партия) КАК ПартияПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.Проект) КАК ПроектПредставление,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТЗ_Запасы.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы).ТипСтруктурнойЕдиницы, """""""") КАК ТипСтруктурнойЕдиницы,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТЗ_Запасы.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	               |	ЕСТЬNULL(ТЗ_Запасы.ОстатокЗапасы, 0) - ЕСТЬNULL(ТЗ_Резервы.ОстатокЗапасы, 0) КАК ОстатокЗапасы,
	               |	ЕСТЬNULL(ТЗ_Запасы.ОстатокЗапасы, 0) - ЕСТЬNULL(ТЗ_Резервы.ОстатокЗапасы, 0) - (ТЗ_Запасы.КоличествоДвижение - ТЗ_Резервы.КоличествоДвижение) КАК КоличествоОстатокЗапасы
	               |ИЗ
	               |	ТЗ_Запасы КАК ТЗ_Запасы
	               //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_Резервы КАК ТЗ_Резервы
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_Резервы КАК ТЗ_Резервы
	               |		ПО ТЗ_Запасы.Организация = ТЗ_Резервы.Организация
	               |			И ТЗ_Запасы.СтруктурнаяЕдиница = ТЗ_Резервы.СтруктурнаяЕдиница
	               |			И ТЗ_Запасы.Номенклатура = ТЗ_Резервы.Номенклатура
	               |			И ТЗ_Запасы.Характеристика = ТЗ_Резервы.Характеристика
	               |			И ТЗ_Запасы.Партия = ТЗ_Резервы.Партия
	               |			И (ВЫБОР
	               |				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
	               |					ТОГДА ТЗ_Запасы.Проект = ТЗ_Резервы.Проект
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |ГДЕ
	               |	ЕСТЬNULL(ТЗ_Запасы.ОстатокЗапасы, 0) - ЕСТЬNULL(ТЗ_Резервы.ОстатокЗапасы, 0) - (ТЗ_Запасы.КоличествоДвижение - ТЗ_Резервы.КоличествоДвижение) < 0
				   //+++ Дмгг, Исключение по реквизиту справочника
	               |	И НЕ ВЫРАЗИТЬ(ТЗ_Запасы.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы).КонтролироватьОстатки
				   //--- Дмгг
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";	
	
	Если ДобавитьРзделитель Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
	КонецЕсли;
	
	Возврат ТекстЗапроса;
			
КонецФункции

Функция ТекстЗапросаПоВременнойТаблицеЗапасов() ЭКСПОРТ
    ПЕРЕМ РЕЗ;
	
	РЕЗ = "ВЫБРАТЬ
	      |	РезервированиеЗапасовОстатки.Организация КАК Организация,
	      |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	      |	РезервированиеЗапасовОстатки.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	      |	РезервированиеЗапасовОстатки.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	      |	РезервированиеЗапасовОстатки.Документ КАК ЗаказПокупателя,
	      |	РезервированиеЗапасовОстатки.Номенклатура КАК Номенклатура,
	      |	РезервированиеЗапасовОстатки.Характеристика КАК Характеристика,
	      |	РезервированиеЗапасовОстатки.Партия КАК Партия,
	      |	РезервированиеЗапасовОстатки.Проект КАК Проект,
	      |	СУММА(РезервированиеЗапасовОстатки.КоличествоОстаток) КАК КоличествоОстаток
	      |ИЗ
	      |	РегистрНакопления.РезервированиеЗапасов.Остатки(
	      |			&Период,
	      |			(Номенклатура, Характеристика, Партия, Документ) В
	      |				(ВЫБРАТЬ
	      |					ТаблицаЗапасы.Номенклатура,
	      |					ТаблицаЗапасы.Характеристика,
	      |					ТаблицаЗапасы.Партия,
	      |					ТаблицаЗапасы.ЗаказПокупателя
	      |				ИЗ
	      |					ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК РезервированиеЗапасовОстатки
	      |ГДЕ
	      |	ВЫБОР
	      |			КОГДА &Организация ЕСТЬ NULL
	      |					ИЛИ &Организация = НЕОПРЕДЕЛЕНО
	      |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	      |				ТОГДА ИСТИНА
	      |			ИНАЧЕ &Организация = РезервированиеЗапасовОстатки.Организация
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &СтруктурнаяЕдиница ЕСТЬ NULL
	      |					ИЛИ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	      |					ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	      |				ТОГДА ИСТИНА
	      |			ИНАЧЕ &СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница
	      |		КОНЕЦ
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	РезервированиеЗапасовОстатки.Организация,
	      |	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница,
	      |	РезервированиеЗапасовОстатки.Номенклатура.СчетУчетаЗапасов,
	      |	РезервированиеЗапасовОстатки.Номенклатура.СчетУчетаЗапасовРегл,
	      |	РезервированиеЗапасовОстатки.Документ,
	      |	РезервированиеЗапасовОстатки.Номенклатура,
	      |	РезервированиеЗапасовОстатки.Характеристика,
	      |	РезервированиеЗапасовОстатки.Партия,
	      |	РезервированиеЗапасовОстатки.Проект";
	
	Возврат РЕЗ;

КонецФункции // ТекстЗапросаПоВременнойТаблицеЗапасов()

Функция ПолучитьОборотыРезервовПоДокументу(ДокументОснование,ДатаПроверки=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	МассивТиповСтруктурнаяЕдиница = Новый Массив();
	МассивТиповСтруктурнаяЕдиница.Добавить(Тип("СправочникСсылка.СтруктурныеЕдиницы"));
	МассивТиповСтруктурнаяЕдиница.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ОписаниеТиповСтруктурнаяЕдиница = Новый ОписаниеТипов(МассивТиповСтруктурнаяЕдиница);
	
	РЕЗ = Новый ТаблицаЗначений();
	РЕЗ.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	РЕЗ.Колонки.Добавить("СтруктурнаяЕдиница",ОписаниеТиповСтруктурнаяЕдиница);
	РЕЗ.Колонки.Добавить("Документ",Документы.ТипВсеСсылки());
	РЕЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	РЕЗ.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	РЕЗ.Колонки.Добавить("Партия",Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"));
	РЕЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	РЕЗ.Колонки.Добавить("КоличествоПриход",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	РЕЗ.Колонки.Добавить("КоличествоРасход",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	РЕЗ.Колонки.Добавить("КоличествоОборот",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	
	Если НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументОснование)) Тогда
	
		Возврат РЕЗ;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		
			Возврат РЕЗ;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДатаПроверки=НЕОПРЕДЕЛЕНО
		ИЛИ (НЕ ((ТипЗНЧ(ДатаПроверки) = Тип("Дата")) И (ТипЗНЧ(ДатаПроверки) = Тип("МоментВремени")) И (ТипЗНЧ(ДатаПроверки) = Тип("Граница"))))
		Тогда
	
		ДатаПроверки = ТекущаяДата();
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеЗапасовОстаткиИОбороты.Организация КАК Организация,
		|	РезервированиеЗапасовОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РезервированиеЗапасовОстаткиИОбороты.Документ КАК Документ,
		|	РезервированиеЗапасовОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	РезервированиеЗапасовОстаткиИОбороты.Характеристика КАК Характеристика,
		|	РезервированиеЗапасовОстаткиИОбороты.Партия КАК Партия,
		|	РезервированиеЗапасовОстаткиИОбороты.Проект КАК Проект,
		|	РезервированиеЗапасовОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		|	РезервированиеЗапасовОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		|	РезервированиеЗапасовОстаткиИОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.РезервированиеЗапасов.ОстаткиИОбороты(, &ДатаПроверки, , , Документ = &ДокументОснование) КАК РезервированиеЗапасовОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	РЕЗ = РезультатЗапроса.Выгрузить();
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьОстаткиРезервовПоДокументу(ДокументОснование,ДатаПроверки=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	МассивТиповСтруктурнаяЕдиница = Новый Массив();
	МассивТиповСтруктурнаяЕдиница.Добавить(Тип("СправочникСсылка.СтруктурныеЕдиницы"));
	МассивТиповСтруктурнаяЕдиница.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ОписаниеТиповСтруктурнаяЕдиница = Новый ОписаниеТипов(МассивТиповСтруктурнаяЕдиница);
	
	РЕЗ = Новый ТаблицаЗначений();
	РЕЗ.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	РЕЗ.Колонки.Добавить("СтруктурнаяЕдиница",ОписаниеТиповСтруктурнаяЕдиница);
	РЕЗ.Колонки.Добавить("Документ",Документы.ТипВсеСсылки());
	РЕЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	РЕЗ.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	РЕЗ.Колонки.Добавить("Партия",Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"));
	РЕЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	РЕЗ.Колонки.Добавить("КоличествоОстаток",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	
	Если НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументОснование)) Тогда
	
		Возврат РЕЗ;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		
			Возврат РЕЗ;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДатаПроверки=НЕОПРЕДЕЛЕНО
		ИЛИ (НЕ ((ТипЗНЧ(ДатаПроверки) = Тип("Дата")) И (ТипЗНЧ(ДатаПроверки) = Тип("МоментВремени")) И (ТипЗНЧ(ДатаПроверки) = Тип("Граница"))))
		Тогда
	
		ДатаПроверки = ТекущаяДата();
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеЗапасовОстатки.Организация КАК Организация,
		|	РезервированиеЗапасовОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РезервированиеЗапасовОстатки.Документ КАК Документ,
		|	РезервированиеЗапасовОстатки.Номенклатура КАК Номенклатура,
		|	РезервированиеЗапасовОстатки.Характеристика КАК Характеристика,
		|	РезервированиеЗапасовОстатки.Партия КАК Партия,
		|	РезервированиеЗапасовОстатки.Проект КАК Проект,
		|	РезервированиеЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.РезервированиеЗапасов.Остатки(&ДатаПроверки, Документ = &ДокументОснование) КАК РезервированиеЗапасовОстатки";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	РЕЗ = РезультатЗапроса.Выгрузить();
	
	Возврат РЕЗ;
КонецФункции

Процедура СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокОбъект, ВыборкаЗаписей, Отказ, МассивСообщений = Неопределено, ПоИтогамРегистра = ЛОЖЬ, ВидОшибкиПоОстакам = 0) ЭКСПОРТ
	
	ЗаголовокОшибки = ?(ПоИтогамРегистра, НСтр("ka='შეცდომა, რეესტრის შედეგების საფუძველზე:';ru='Ошибка, по итогам регистра:'"
	+ ";en='Error based on the register:'"	
	), НСтр("ka='შეცდომა:';ru='Ошибка:';en='Mistake:'"));
	ШаблонЗаголовкаСообщения = ЗаголовокОшибки + НСтр("ka='მარაგების და დანახარჯების აღრიცხვის მიხედვით ნაშთი საკმარისი არ არის %СтруктурнаяЕдиницаПредставление%';ru='Не хватает остатка по учету запасов и затрат %СтруктурнаяЕдиницаПредставление%'"
	+ ";en='There is not enough balance to account for inventory and costs %СтруктурнаяЕдиницаПредставление%'"	
	);

	Если ВидОшибкиПоОстакам = 2 Тогда
		СтрокаОстаток = НСтр("ru='свободный остаток ';ka='თავისუფალი ნაშთი ';en='free balance '");
	ИначеЕсли ВидОшибкиПоОстакам = 1 Тогда
		СтрокаОстаток = НСтр("ru='резерв ';ka='რეზერვი ';en='reserved '");
	Иначе
		СтрокаОстаток = НСтр("ru='остаток ';ka='ნაშთი ';en='remainder '"); 
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='Номенклатура: %НоменклатураХарактеристикаПартия%,
	|"+СтрокаОстаток+"%КоличествоОстаток% %ЕдиницаИзмерения%,"
	"недостаточно %КоличествоИРезерв% %ЕдиницаИзмерения%';ka='ნომენკლატურა: %НоменклатураХарактеристикаПартия%,
	|"+СтрокаОстаток+"%КоличествоОстаток% %ЕдиницаИзмерения%,"
	"არ არის საკმარისი %КоличествоИРезерв% %ЕдиницаИзмерения%'"
	+ ";en='Nomenclature: %НоменклатураХарактеристикаПартия%,
	|"+СтрокаОстаток+"%КоличествоОстаток% %ЕдиницаИзмерения%,"
	"not enough %КоличествоИРезерв% %ЕдиницаИзмерения%'"	
	);    
	
	
	ВыводитьВЗаголовокРасшифровку = Истина;
	УчетПоНесколькимСкладам = Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить();
	УчетПоНесколькимПодразделениям = Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить();
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		Если ВыводитьВЗаголовокРасшифровку Тогда
			
			ПредставлениеСтруктурнойЕдиницы = СокрЛП(ВыборкаЗаписей.СтруктурнаяЕдиницаПредставление);
			
			ТекстЗаголовкаСообщения = СтрЗаменить(ШаблонЗаголовкаСообщения, "%СтруктурнаяЕдиницаПредставление%", ПредставлениеСтруктурнойЕдиницы);
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокОбъект, ТекстЗаголовкаСообщения, , , , Отказ, МассивСообщений);
			ВыводитьВЗаголовокРасшифровку = Ложь;
			
		КонецЕсли;
		
		ПредставлениеНоменклатуры = УправлениеНебольшойФирмойСервер.ПредставлениеНоменклатуры(ВыборкаЗаписей.НоменклатураПредставление, ВыборкаЗаписей.ХарактеристикаПредставление, ВыборкаЗаписей.ПартияПредставление);
		
		СписокДопПолей = "СчетУчетаРеглПредставление,ПроектПредставление";
		СтруктураДопПолей = Новый Структура(СписокДопПолей);
		ЗаполнитьЗначенияСвойств(СтруктураДопПолей,ВыборкаЗаписей);
		СписокДопПолейНоменклатуры = СтрРазделить(СписокДопПолей,",");
		Для Каждого СтрПоля из СписокДопПолейНоменклатуры Цикл
			ЗначениеПоля = "";
			Если СтруктураДопПолей.Свойство(СтрПоля, ЗначениеПоля) Тогда
				ПредставлениеНоменклатуры = ПредставлениеНоменклатуры + " / " + ЗначениеПоля;
			КонецЕсли;	
		КонецЦикла;
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристикаПартия%", ПредставлениеНоменклатуры);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОстаток%", Строка(ВыборкаЗаписей.ОстатокЗапасы));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоИРезерв%", Строка(-ВыборкаЗаписей.КоличествоОстатокЗапасы));
		
		// Заказы покупателей в Рознице
		Если ЗначениеЗаполнено(ВыборкаЗаписей.ЗаказПокупателяПредставление) Тогда
			ТекстСообщения = ТекстСообщения + ". " + ВыборкаЗаписей.ЗаказПокупателяПредставление;
		КонецЕсли;
		// Конец Заказы покупателей в Рознице
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", СокрЛП(ВыборкаЗаписей.ЕдиницаИзмеренияПредставление));
		
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокОбъект, ТекстСообщения, , , , Отказ, МассивСообщений);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуСвободныхОстатков(МенеджерВременныхТаблиц, ДатаПроверки) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	КонтролироватьОстаткиПриПроведенииПоПроектам = Константы.ФункциональнаяОпцияУчетПоПроектам.Получить() И Константы.КонтролироватьОстаткиПриПроведенииПоПроектам.Получить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
		//|	ТаблицаДанных.Организация КАК Организация,
		//|	ТаблицаДанных.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|	ТаблицаДанных.Номенклатура КАК Номенклатура,
		//|	ТаблицаДанных.Характеристика КАК Характеристика,
		//|	ТаблицаДанных.Партия КАК Партия,
		//|	ТаблицаДанных.Проект КАК Проект,
		|	ТаблицаДанных.Количество КАК Количество,
		|	ТаблицаДанных.Резерв КАК Резерв,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
		|	ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК ОжидаемыеПоставки,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК ОжидаемыеСвободныеОстатки
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&ДатаПроверки,
		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
		|					(ВЫБРАТЬ
		|						ТаблицаДанных.Организация,
		|						ТаблицаДанных.СтруктурнаяЕдиница,
		|						ТаблицаДанных.Номенклатура,
		|						ТаблицаДанных.Характеристика,
		|						ТаблицаДанных.Партия
		|					ИЗ
		|						ТаблицаДанных КАК ТаблицаДанных)) КАК ЗапасыОстатки
		|		ПО ТаблицаДанных.Организация = ЗапасыОстатки.Организация
		|			И ТаблицаДанных.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ТаблицаДанных.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ТаблицаДанных.Характеристика = ЗапасыОстатки.Характеристика
		|			И ТаблицаДанных.Партия = ЗапасыОстатки.Партия
		|			И (ВЫБОР
		|				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
		|					ТОГДА ТаблицаДанных.Проект = ЗапасыОстатки.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) >= 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервированиеЗапасов.Остатки(
		|				&ДатаПроверки,
		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия) В
		|					(ВЫБРАТЬ
		|						ТаблицаДанных.Организация,
		|						ТаблицаДанных.СтруктурнаяЕдиница,
		|						ТаблицаДанных.Номенклатура,
		|						ТаблицаДанных.Характеристика,
		|						ТаблицаДанных.Партия
		|					ИЗ
		|						ТаблицаДанных КАК ТаблицаДанных)) КАК РезервированиеЗапасовОстатки
		|		ПО ТаблицаДанных.Организация = РезервированиеЗапасовОстатки.Организация
		|			И ТаблицаДанных.СтруктурнаяЕдиница = РезервированиеЗапасовОстатки.СтруктурнаяЕдиница
		|			И ТаблицаДанных.Номенклатура = РезервированиеЗапасовОстатки.Номенклатура
		|			И ТаблицаДанных.Характеристика = РезервированиеЗапасовОстатки.Характеристика
		|			И ТаблицаДанных.Партия = РезервированиеЗапасовОстатки.Партия
		|			И (ВЫБОР
		|				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
		|					ТОГДА ТаблицаДанных.Проект = РезервированиеЗапасовОстатки.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ЕСТЬNULL(РезервированиеЗапасовОстатки.КоличествоОстаток, 0) >= 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				&ДатаПроверки,
		|				(Организация, Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ТаблицаДанных.Организация,
		|						ТаблицаДанных.Номенклатура,
		|						ТаблицаДанных.Характеристика
		|					ИЗ
		|						ТаблицаДанных КАК ТаблицаДанных)) КАК ЗаказыПоставщикамОстатки
		|		ПО (ТаблицаДанных.Организация = РезервированиеЗапасовОстатки.Организация)
		|			И ТаблицаДанных.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
		|			И ТаблицаДанных.Характеристика = ЗаказыПоставщикамОстатки.Характеристика
		|			И (ВЫБОР
		|				КОГДА &КонтролироватьОстаткиПриПроведенииПоПроектам
		|					ТОГДА ТаблицаДанных.Проект = ЗаказыПоставщикамОстатки.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) >= 0)";
	
	Запрос.УстановитьПараметр("ДатаПроверки",ДатаПроверки);
	Запрос.УстановитьПараметр("КонтролироватьОстаткиПриПроведенииПоПроектам",КонтролироватьОстаткиПриПроведенииПоПроектам);
	
	РЕЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат РЕЗ;
КонецФункции
